cf_billing/InformationRegisters/энргСтабильныеПериодыМКДШкалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтабильныеПериодыМКДШкалы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщикаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугамиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьБойлерМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеПлощадиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатковМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидБлагоустройстваМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтабильныеПериодыМКДШкалы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет стабильные периоды шкалы.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СтабильныеПериодыШкалы(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериодыШкалы());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, ТочкаУчета, НомерПозиции, Шкала, ДатаРегистратора, ДокРегистратор";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Получает текст запроса стабильные периоды шкалы.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСтабильныеПериодыШкалы() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргСтабильныеПериодыШкалы.Организация КАК Организация,
	|	энргСтабильныеПериодыШкалы.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыШкалы.Район КАК Район,
	|	энргСтабильныеПериодыШкалы.МКД КАК МКД,
	|	энргСтабильныеПериодыШкалы.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыШкалы.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыШкалы.Шкала КАК Шкала,
	|	энргСтабильныеПериодыШкалы.ДатаРегистратора КАК ДатаРегистратора,
	|	энргСтабильныеПериодыШкалы.ДокРегистратор КАК ДокРегистратор,
	|	энргСтабильныеПериодыШкалы.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКДШкалы КАК энргСтабильныеПериодыШкалы";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
